# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CategoryNameMap..::..Insert Method
CategoryNameMap Class See Also
---
Insert the specified category with the specified name into the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	string key,
	Category item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	key As String, _
	item As Category _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	String^ key,
	Category^ item
)
```

# ### Parameters
key
    Type: System..::..StringThe name to be used for inserting the category into the map.
item
    Type: Autodesk.Revit.DB..::..CategoryThe category to be inserted into the map.
# ### Return Value
Returns whether the category was inserted into the map.
# See Also
CategoryNameMap Class
Autodesk.Revit.DB Namespace